app/Http/Controllers/CommentController.php

    public function store(Request $request)
    {
//        $comment= new Comment();
//        $comment->post_id=$request->id;
//        $comment->comment=$request->comments;
//        $comment->save();
        $id=DB::table('coments')->insertGetId([
            'post_id' =>$request->id,
            'comment' => $request->comments
        ]);
---
insert into `coments` (`post_id`, `comment`, `updated_at`, `created_at`) values ('90', 'v', '2020-12-15 23:13:17', '2020-12-15 23:13:17')