app/Http/Controllers/PostController.php

//            $post->images()->save($file);
            DB::table('images')->insert(  ['post_id' => $posts->id,'name' => $new_name ]);
        }
        return redirect()->route('posts.index')
            ->with('success','Posts created successfully.');
---
select * from `images` where `images`.`post_id` = 90 and `images`.`post_id` is not null