app/Http/Controllers/PostController.php

select * from `tags`
---
    public function create()
    {
        $tags = Tag::all();

select * from `post_tag` where `post_id` = 91
insert into `post_tag` (`post_id`, `tag_id`) values (91, 4)
insert into `posts` (`title`, `description`, `posted_by`, `user_id`, `updated_at`, `created_at`) values ('Prof.', 'hi mjan', 'hello@gmail.com', 1, '2020-12-19 05:02:46', '2020-12-19 05:02:46')
insert into `images` (`name`, `post_id`, `updated_at`, `created_at`) values ('1087166456.png', 91, '2020-12-15 10:18:39', '2020-12-15 10:18:39')
---
    public function store(PostRequest $request)
    {
        $input = $request->only(['title', 'description']);
        $input['user_id'] = Auth::id();
        $input['posted_by'] = auth()->user()->email;
        $post = Post::create($input);

        $tags = array();
        foreach ($request->tags as $tag) {
            $tag = Tag::firstOrCreate([
                'name' => $tag
            ]);
            $tags[] = $tag->id;
        }
        $post->tags()->sync($tags, false);
        if ($request->has('files')) {
            $images = $request->file('files');
            foreach ($images as $image) {
                $new_name = rand() . '.' . $image->getClientOriginalExtension();
                $image->move(public_path('files'), $new_name);
                $file = new Image();
                $file->name = $new_name;
                $post->images()->save($file);

select * from `tags`
---
    public function edit(Post $post)
    {
        $tags = Tag::all();